//just use to test the comps code
$(function(){
	// console.profile('加载性能测试');
	// // 加载下拉框
	// var selectDatas = {"title":"灾害类型：","cite":"请选择类型",'id' : 'province',"defaultCheck" : "",
	// 	"list":[{"text":"广东省","value":"1"},
	// 	{"text":"福建省","value":"2"},
	// 	{"text":"湖南省","value":"3"}]};
	// var selectDiv = selectComp.init('100',selectDatas,selectBack);
	// function selectBack(sBack){
	// 	console.info(sBack);
	// }
	
	// // 加载影响区域
	// var effectAreaDatas = {"title" : "影响区域：","list" : [{"text":"广东省","value":"1"},
	// {"text":"福建省","value":"2"},{"text":"湖南省","value":"3"}]};
	// var areaDiv = effectAreaComp.init(effectAreaDatas);
	
	// // 加载按钮
	// var btnDatas = {"list":[{"value":"reset","text":"重置"},{"value":"send","text":"发送"}]}; 
	// var btn = buttonComp.init(btnDatas,'tempTarget-btn');
	// T('demo').addComps([selectDiv,areaDiv,btn],btn,'send',sendBack);
	// function sendBack(sBack){
	// 	console.info(sBack);
	// }
	
	// // 加载可拖动的窗口
	// var winDatasA = {"title":"可拖动窗口A","id":"one","wx":300,"wy":400};
	// var conDEA = T().CDE('div');
	// conDEA.innerHTML = 'A的内容对象';
    // windowDragComp.init(winDatasA,conDEA);
	// // var winDatasB = {"title":"可拖动窗口B","id":"one","wx":300,"wy":200};
	// // var conDEB = T().CDE('div');
	// // conDEB.innerHTML = 'B的内容对象';
	// // windowDragComp.init(winDatasB,conDEB);
	
	// // 加载可无限滚动加载的div内容框
	// var scDatas = {"list":[
	// 		{"num":"1","text":"测试测试测试测试测试"},
	// 		{"num":"2","text":"测试测试测试测试测试"},
	// 		{"num":"3","text":"测试测试测试测试测试"},
	// 		{"num":"4","text":"测试测试测试测试测试"},
	// 		{"num":"5","text":"测试测试测试测试测试"},
	// 		{"num":"6","text":"测试测试测试测试测试"},
	// 		{"num":"7","text":"测试测试测试测试测试"},
	// 		{"num":"8","text":"测试测试测试测试测试"},
	// 		{"num":"9","text":"测试测试测试测试测试"},
	// 		{"num":"10","text":"测试测试测试测试测试"},
	// 		{"num":"11","text":"测试测试测试测试测试"},
	// 		{"num":"12","text":"测试测试测试测试测试"},
	// 		{"num":"13","text":"测试测试测试测试测试"},
	// 		{"num":"14","text":"测试测试测试测试测试"},
	// 		{"num":"15","text":"测试测试测试测试测试"},
	// 		{"num":"16","text":"测试测试测试测试测试"},
	// 		{"num":"17","text":"测试测试测试测试测试"},
	// 		{"num":"18","text":"测试测试测试测试测试"},
	// 		{"num":"19","text":"测试测试测试测试测试"},
	// 		{"num":"20","text":"测试测试测试测试测试"},
	// 		{"num":"21","text":"测试测试测试测试测试"},
	// 		{"num":"22","text":"测试测试测试测试测试"},
	// 		{"num":"23","text":"测试测试测试测试测试"},
	// 		{"num":"24","text":"测试测试测试测试测试"},
	// 		{"num":"25","text":"测试测试测试测试测试"},
	// 		{"num":"26","text":"测试测试测试测试测试"},
	// 		{"num":"27","text":"测试测试测试测试测试"},
	// 		{"num":"28","text":"测试测试测试测试测试"},
	// 		{"num":"29","text":"测试测试测试测试测试"},
	// 		{"num":"30","text":"测试测试测试测试测试"},
	// 		{"num":"31","text":"测试测试测试测试测试"},
	// 		{"num":"32","text":"测试测试测试测试测试"},
	// 		{"num":"33","text":"测试测试测试测试测试"},
	// 		{"num":"34","text":"测试测试测试测试测试"},
	// 		{"num":"35","text":"测试测试测试测试测试"},
	// 		{"num":"36","text":"测试测试测试测试测试"},
	// 		{"num":"37","text":"测试测试测试测试测试"},
	// 		{"num":"38","text":"测试测试测试测试测试"},
	// 		{"num":"39","text":"测试测试测试测试测试"},
	// 		{"num":"40","text":"测试测试测试测试测试"},
	// 		{"num":"41","text":"测试测试测试测试测试"},
	// 		{"num":"42","text":"测试测试测试测试测试"},
	// 		{"num":"43","text":"测试测试测试测试测试"}
	// 	]};
	// 	var sLArr = [];
	// 	for(var sKey in scDatas.list){
	// 		var liE = document.createElement('li');
	// 		var spanO = document.createElement('span');
	// 		spanO.innerHTML = scDatas.list[sKey].num;
	// 		var spanT = document.createElement('span');
	// 		spanT.innerHTML = scDatas.list[sKey].text;
	// 		liE.appendChild(spanO);
	// 		liE.appendChild(spanT);
	// 		sLArr.push(liE);
	// 	}
	// scroolLoadComp.init('autoLoadA',sLArr,15);
	
	// var icComp = infoCountComp.init();
	// T('count').addComps([icComp]);
	
	
	// var searchDatas = {"tab":[{"title":"POI","value":"poi","warn":"请输入POI名称"},
	// 	{"title":"观测站","value":"site","warn":"请输入站点编号或名称"},
	// 	{"title":"灾害点","value":"demage","warn":"请输入灾害点名称或地址"},
	// 	{"title":"经纬度","value":"lonlat","warn":"请输入经纬度值，如：123.54;23.0...以;号分隔",
	// 	"erroe":"经纬度数据格式错误"}],
	// 	"defaultSelect":"经纬度",
	// 	"button":"搜索","backButton":"隐藏"};
	// var searchComp = searchBarComp.init(searchDatas,searchBack,hideBack);
	// T('searchBar').addComps([searchComp]);
	// function searchBack(rDatas){
	// 	var showInfo = '';
	// 	var status = true;
	// 	if(rDatas.type === 'lonlat'){
	// 		var item = searchBarComp.getSearchItem();
	// 		if((rDatas.value).indexOf(';') === -1){
	// 			showInfo = '格式错误，缺少\";\"号';
	// 		}else{
	// 			var lonlat = (rDatas.value).split(';');
	// 			if(lonlat.length === 2){
	// 				if(lonlat[0] !== '' && lonlat[1] !== ''){
	// 					if(isNaN(lonlat[0]) || isNaN(lonlat[1])){
	// 						showInfo = '格式错误，经纬度必须为数字';
	// 					}else if(lonlat[0]>180 || lonlat[0]<-180){
	// 						showInfo = '格式错误，经度不正确';
	// 					}else if(lonlat[1]>90 || lonlat[1]<-90){
	// 						showInfo = '格式错误，纬度不正确';
	// 					}else{
	// 						status = false;
	// 						console.info(lonlat);
	// 					}
	// 				}else{
	// 					showInfo = '格式错误，经纬度不正确';
	// 				}
	// 			}else{
	// 				showInfo = '格式错误，经纬度不正确';
	// 			}
	// 		}
	// 		item.span.innerHTML = showInfo;
	// 		if(status){
	// 			item.input.value = '';
	// 		}
	// 	}else{
	// 		console.info(rDatas);
	// 	}
	// }
	// function hideBack(){
	// 	console.info('hide');
	// }
	mapComp.buildMap('map');
	initToolBar.init(mapComp.getMap(),'阳江市',saveEvent);
	function saveEvent(jsonDatas){
		console.info(jsonDatas);
	}
	
	var jsonDatas = {"Point":[{"type":"Point","text":"","size":15,"color":"#ed3f2b","fsize":"","fcolor":"","cursor":"move","geometry":"POINT(111.80419921875 24.2626953125)"}],"text":[{"type":"text","text":"1","size":"1","color":"#ed3f2b","fsize":"1","fcolor":"#ed3f2b","cursor":"move","geometry":"POINT(114.44091796875 24.658203125)"}],"dynamicLinePoint":[{"type":"dynamicLinePoint","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"pointer","geometry":"POINT(114.35302734375 27.03125)"},{"type":"dynamicLinePoint","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"pointer","geometry":"POINT(113.56201171875 23.33984375)"},{"type":"dynamicLinePoint","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"pointer","geometry":"POINT(116.24267578125 22.6806640625)"},{"type":"dynamicLinePoint","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"pointer","geometry":"POINT(118.00048828125 25.8447265625)"}],"dynamicLine":[{"type":"dynamicLine","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"pointer","geometry":"LINESTRING(114.35302734375 27.03125,113.56201171875 23.33984375,116.24267578125 22.6806640625,118.00048828125 25.8447265625)"}],"arrowPolygon":[{"type":"arrowPolygon","text":"","size":0.1296,"color":"#ed3f2b","fsize":"","fcolor":"","cursor":"move","geometry":"POLYGON((119.61617764254466 29.15205270930734,119.54886141995534 29.04130666569266,122.5314458570122 27.228363184344374,122.46412963442287 27.11761714072969,124.05639618683529 26.37726446547757,122.66607830219084 27.449855271573742,122.59876207960151 27.339109227959057,119.61617764254466 29.15205270930734))"}],"RegularPolygon":[{"type":"RegularPolygon","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"move","geometry":"POLYGON((119.88437193295766 21.123498381352377,119.69853811314822 21.143551029456177,119.51711200546413 21.183340083424316,119.3429548080023 21.24223804610688,119.17881308380315 21.319316061448433,119.0272754459108 21.41335856310286,118.89073173339905 21.522882444640807,118.77133532218146 21.646160449024023,118.67096916498684 21.78124840848067,118.59121609607006 21.926015905192493,118.53333386897006 22.078179869256424,118.4982353209854 22.235340584060836,118.48647397718463 22.39501953125,118.4982353209854 22.554698478439164,118.53333386897006 22.711859193243576,118.59121609607006 22.864023157307507,118.67096916498684 23.00879065401933,118.77133532218146 23.14387861347598,118.89073173339905 23.267156617859193,119.0272754459108 23.37668049939714,119.17881308380315 23.470723001051567,119.3429548080023 23.54780101639312,119.51711200546413 23.606698979075684,119.69853811314822 23.646488033043823,119.88437193295766 23.666540681147623,120.07168275454234 23.666540681147623,120.25751657435178 23.646488033043823,120.43894268203587 23.606698979075684,120.6130998794977 23.54780101639312,120.77724160369685 23.470723001051567,120.92877924158918 23.37668049939714,121.06532295410095 23.267156617859193,121.18471936531854 23.143878613475977,121.28508552251316 23.008790654019325,121.36483859142994 22.864023157307507,121.42272081852994 22.711859193243576,121.4578193665146 22.554698478439164,121.46958071031537 22.39501953125,121.4578193665146 22.235340584060836,121.42272081852994 22.078179869256427,121.36483859142994 21.926015905192493,121.28508552251316 21.781248408480675,121.18471936531854 21.64616044902402,121.06532295410095 21.522882444640807,120.92877924158918 21.41335856310286,120.77724160369687 21.319316061448433,120.6130998794977 21.24223804610688,120.43894268203587 21.183340083424316,120.25751657435178 21.143551029456177,120.07168275454234 21.123498381352377,119.88437193295766 21.123498381352377))"},{"type":"RegularPolygon","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"move","geometry":"POLYGON((110.44189453125 20.0439453125,110.44189453125 22.9443359375,113.16650390625 22.9443359375,113.16650390625 20.0439453125,110.44189453125 20.0439453125))"}],"Polygon":[{"type":"Polygon","text":"33","size":"1","color":"#ed3f2b","fsize":12,"fcolor":"#ed3f2b","cursor":"move","geometry":"POLYGON((110.74951171875 18.1982421875,110.83740234375 18.1982421875,110.88134765625 18.1982421875,110.92529296875 18.1982421875,111.01318359375 18.1982421875,111.10107421875 18.1982421875,111.27685546875 18.154296875,111.45263671875 18.1103515625,111.54052734375 18.0224609375,111.62841796875 17.8466796875,111.84814453125 17.5390625,111.97998046875 17.1435546875,111.97998046875 16.7041015625,111.89208984375 16.0009765625,111.76025390625 15.78125,111.05712890625 15.2978515625,110.52978515625 15.166015625,110.00244140625 15.1220703125,109.47509765625 15.1220703125,109.16748046875 15.1220703125,108.99169921875 15.25390625,108.85986328125 15.4736328125,108.72802734375 15.869140625,108.59619140625 16.220703125,108.46435546875 16.7919921875,108.33251953125 17.4072265625,108.24462890625 18.330078125,108.24462890625 18.857421875,108.24462890625 19.296875,108.24462890625 19.736328125,108.24462890625 20.1318359375,108.28857421875 20.3515625,108.33251953125 20.5712890625,108.37646484375 20.8349609375,108.37646484375 21.0546875,108.37646484375 21.142578125,108.37646484375 21.318359375,108.37646484375 21.40625,108.37646484375 21.4501953125,108.37646484375 21.5380859375,108.37646484375 21.6259765625,108.37646484375 21.7138671875,108.33251953125 21.7578125,108.33251953125 21.8017578125,108.28857421875 21.8017578125,110.74951171875 18.1982421875))"}],"staticLine":[{"type":"staticLine","text":"","size":"1","color":"#ed3f2b","fsize":"","fcolor":"","cursor":"move","geometry":"LINESTRING(124.46044921875 29.404296875,124.46044921875 29.4482421875,124.46044921875 29.4921875,124.41650390625 29.4921875,124.28466796875 29.5361328125,124.19677734375 29.5361328125,123.80126953125 29.5361328125,123.18603515625 29.4921875,122.52685546875 29.2724609375,121.77978515625 28.7890625,121.20849609375 28.349609375,120.63720703125 27.822265625,120.24169921875 27.294921875,119.93408203125 26.7236328125,119.62646484375 25.9326171875,119.31884765625 24.8779296875,119.14306640625 24.130859375,118.92333984375 23.5595703125,118.65966796875 22.98828125,118.26416015625 22.28515625,117.82470703125 21.669921875,117.34130859375 21.0546875,116.94580078125 20.6591796875,116.55029296875 20.2197265625,116.11083984375 19.82421875,115.80322265625 19.5166015625,115.53955078125 19.2529296875,115.40771484375 18.9453125,115.40771484375 18.8134765625,115.40771484375 18.7255859375,115.40771484375 18.5498046875,115.40771484375 18.3740234375,115.36376953125 18.154296875,115.31982421875 17.9345703125,115.31982421875 17.71484375,115.23193359375 17.451171875,115.18798828125 17.3193359375,115.14404296875 17.099609375,115.10009765625 16.748046875,115.10009765625 16.572265625,115.10009765625 16.4404296875,115.10009765625 16.30859375)"}],"zoom":5,"lon":120,"lat":20,"caseId":""};
	mapComp.restoreLayer(mapComp.getMap(),jsonDatas);
	mapComp.restoreLayer(mapComp.getMap(),jsonDatas);
});